Revit 2026 API

# LineLoadStartPoint Property

---

Returns the three dimensional location of the start point for the line load.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ StartPoint { get; }
```
```vb
Public ReadOnly Property StartPoint As XYZ
	Get
```
```cpp
public:
property XYZ^ StartPoint {
	XYZ^ get ();
}
```
```fsharp
member StartPoint : XYZ with get
```

#### Property Value

XYZ

The location of the start point is measured in decimal feet.

#### Reference

LineLoad Class

Autodesk.Revit.DB.Structure Namespace